zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_K566_LPE_GPR0.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_K566_LPE_GPR0
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_K566_LPE_GPR0_H_)  /* Check if memory map has not been already included */
#define S32K566_K566_LPE_GPR0_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- K566_LPE_GPR0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_LPE_GPR0_Peripheral_Access_Layer K566_LPE_GPR0 Peripheral Access Layer
 * @{
 */

/** K566_LPE_GPR0 - Register Layout Typedef */
typedef struct K566_LPE_GPR0_Struct {
  __IO uint32_t GPR_RWP_0;                         /**< Read Write POR 0, offset: 0x0 */
  __IO uint32_t GPR_RWP_1;                         /**< Read Write POR 1, offset: 0x4 */
  uint8_t RESERVED_0[8];
  __IO uint32_t GPR_RWP_4;                         /**< Read Write POR 4, offset: 0x10 */
  uint8_t RESERVED_1[2028];
  __IO uint32_t GPR_W1CP_0;                        /**< Write 1 to Clear POR 0, offset: 0x800 */
  __IO uint32_t GPR_W1CP_1;                        /**< Write 1 to Clear POR 1, offset: 0x804 */
  __IO uint32_t GPR_W1CP_2;                        /**< Write 1 to Clear POR 2, offset: 0x808 */
  __IO uint32_t GPR_W1CP_3;                        /**< Write 1 to Clear POR 3, offset: 0x80C */
  uint8_t RESERVED_2[2032];
  __IO uint32_t GPR_RWD_0;                         /**< Read Write DEST 0, offset: 0x1000 */
  __IO uint32_t GPR_RWD_1;                         /**< Read Write DEST 1, offset: 0x1004 */
  uint8_t RESERVED_3[2040];
  __I  uint32_t GPR_ROD_0;                         /**< Read Only DEST 0, offset: 0x1800 */
  __IO uint32_t GPR_ROD_1;                         /**< Read Only DEST 1, offset: 0x1804 */
  __IO uint32_t GPR_ROD_2;                         /**< Read Only DEST 2, offset: 0x1808 */
  uint8_t RESERVED_4[2036];
  __IO uint32_t GPR_RWF_0;                         /**< Read Write FUNC 0, offset: 0x2000 */
  __IO uint32_t GPR_RWF_1;                         /**< Read Write FUNC 1, offset: 0x2004 */
  uint8_t RESERVED_5[2040];
  __I  uint32_t GPR_ROF_0;                         /**< Read Only FUNC 0, offset: 0x2800 */
  __I  uint32_t GPR_ROF_1;                         /**< Read Only FUNC 1, offset: 0x2804 */
  __I  uint32_t GPR_ROF_2;                         /**< Read Only FUNC 2, offset: 0x2808 */
} K566_LPE_GPR0_Type, *K566_LPE_GPR0_MemMapPtr;

/** Number of instances of the K566_LPE_GPR0 module. */
#define K566_LPE_GPR0_INSTANCE_COUNT             (1u)

/* K566_LPE_GPR0 - Peripheral instance base addresses */
/** Peripheral LPE_GPR_0 base address */
#define IP_LPE_GPR_0_BASE                        (0x42040000u)
/** Peripheral LPE_GPR_0 base pointer */
#define IP_LPE_GPR_0                             ((K566_LPE_GPR0_Type *)IP_LPE_GPR_0_BASE)
/** Array initializer of K566_LPE_GPR0 peripheral base addresses */
#define IP_K566_LPE_GPR0_BASE_ADDRS              { IP_LPE_GPR_0_BASE }
/** Array initializer of K566_LPE_GPR0 peripheral base pointers */
#define IP_K566_LPE_GPR0_BASE_PTRS               { IP_LPE_GPR_0 }

/* ----------------------------------------------------------------------------
   -- K566_LPE_GPR0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_LPE_GPR0_Register_Masks K566_LPE_GPR0 Register Masks
 * @{
 */

/*! @name GPR_RWP_0 - Read Write POR 0 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWP_0_GATING_SIG_MASK  (0x1U)
#define K566_LPE_GPR0_GPR_RWP_0_GATING_SIG_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWP_0_GATING_SIG_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_0_GATING_SIG(x)    (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_0_GATING_SIG_SHIFT)) & K566_LPE_GPR0_GPR_RWP_0_GATING_SIG_MASK)

#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0_MASK    (0x40000000U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0_SHIFT   (30U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0_WIDTH   (1U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0_SHIFT)) & K566_LPE_GPR0_GPR_RWP_0_LOCK_EN0_MASK)

#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1_MASK    (0x80000000U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1_SHIFT   (31U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1_WIDTH   (1U)
#define K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1_SHIFT)) & K566_LPE_GPR0_GPR_RWP_0_LOCK_EN1_MASK)
/*! @} */

/*! @name GPR_RWP_1 - Read Write POR 1 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN_MASK (0xFFFFFFFFU)
#define K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN_WIDTH (32U)
#define K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN_SHIFT)) & K566_LPE_GPR0_GPR_RWP_1_DEST_ESC_TRIGGER_EN_MASK)
/*! @} */

