zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
/*! @name GPR_RWP_4 - Read Write POR 4 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE_MASK (0x1U)
#define K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_STDBY_GPR_DISABLE_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT_MASK (0x6U)
#define K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT_SHIFT (1U)
#define K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT_WIDTH (2U)
#define K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_POR_WDOG_TIMEOUT_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG_MASK (0x8U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG_SHIFT (3U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_CLKOUT_CONFIG_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE_MASK (0x80U)
#define K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE_SHIFT (7U)
#define K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_LPE_GPR_DISABLE_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_PKG_ID_MASK      (0x200U)
#define K566_LPE_GPR0_GPR_RWP_4_PKG_ID_SHIFT     (9U)
#define K566_LPE_GPR0_GPR_RWP_4_PKG_ID_WIDTH     (1U)
#define K566_LPE_GPR0_GPR_RWP_4_PKG_ID(x)        (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_PKG_ID_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_PKG_ID_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE_MASK (0x400U)
#define K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE_SHIFT (10U)
#define K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE(x)   (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_PUE_EXTWAKE_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE_MASK (0x800U)
#define K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE_SHIFT (11U)
#define K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE(x)   (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_PUS_EXTWAKE_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN_SHIFT (12U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_CLK_EN_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL_MASK (0x1FE000U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL_SHIFT (13U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL_WIDTH (8U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_DIV_VAL_MASK)

#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL_MASK (0x7E00000U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL_SHIFT (21U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL_WIDTH (6U)
#define K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL_SHIFT)) & K566_LPE_GPR0_GPR_RWP_4_CLKOUT_STANDBY_MUX_SEL_MASK)
/*! @} */

/*! @name GPR_W1CP_0 - Write 1 to Clear POR 0 */
/*! @{ */

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0_MASK (0x1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0_SHIFT (0U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT0_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1_MASK (0x2U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1_SHIFT (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT1_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2_MASK (0x4U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2_SHIFT (2U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT2_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3_MASK (0x8U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3_SHIFT (3U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT3_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4_MASK (0x10U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4_SHIFT (4U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT4_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5_MASK (0x20U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5_SHIFT (5U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT5_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6_MASK (0x40U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6_SHIFT (6U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT6_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7_MASK (0x80U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7_SHIFT (7U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT7_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8_MASK (0x100U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8_SHIFT (8U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT8_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9_MASK (0x200U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9_SHIFT (9U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT9_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10_MASK (0x400U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10_SHIFT (10U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT10_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11_MASK (0x800U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11_SHIFT (11U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT11_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12_SHIFT (12U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT12_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13_MASK (0x2000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13_SHIFT (13U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT13_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14_MASK (0x4000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14_SHIFT (14U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT14_MASK)

