zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15_MASK (0x8000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15_SHIFT (15U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT15_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16_MASK (0x10000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16_SHIFT (16U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT16_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17_MASK (0x20000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17_SHIFT (17U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT17_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18_MASK (0x40000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18_SHIFT (18U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT18_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19_MASK (0x80000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19_SHIFT (19U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT19_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20_MASK (0x100000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20_SHIFT (20U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT20_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21_MASK (0x200000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21_SHIFT (21U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT21_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22_MASK (0x400000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22_SHIFT (22U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT22_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23_MASK (0x800000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23_SHIFT (23U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT23_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24_MASK (0x1000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24_SHIFT (24U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT24_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25_MASK (0x2000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25_SHIFT (25U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT25_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26_MASK (0x4000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26_SHIFT (26U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT26_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27_MASK (0x8000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27_SHIFT (27U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT27_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28_MASK (0x10000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28_SHIFT (28U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT28_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29_MASK (0x20000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29_SHIFT (29U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT29_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30_MASK (0x40000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30_SHIFT (30U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT30_MASK)

#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31_MASK (0x80000000U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31_SHIFT (31U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_0_POR_WDOG_STAT31_MASK)
/*! @} */

/*! @name GPR_W1CP_1 - Write 1 to Clear POR 1 */
/*! @{ */

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0_MASK (0x1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0_SHIFT (0U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT0_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1_MASK (0x2U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1_SHIFT (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT1_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2_MASK (0x4U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2_SHIFT (2U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT2_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3_MASK (0x8U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3_SHIFT (3U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT3_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4_MASK (0x10U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4_SHIFT (4U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT4_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5_MASK (0x20U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5_SHIFT (5U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT5_MASK)

