zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6_MASK (0x40U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6_SHIFT (6U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT6_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7_MASK (0x80U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7_SHIFT (7U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT7_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8_MASK (0x100U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8_SHIFT (8U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT8_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9_MASK (0x200U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9_SHIFT (9U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT9_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10_MASK (0x400U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10_SHIFT (10U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT10_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11_MASK (0x800U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11_SHIFT (11U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT11_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12_SHIFT (12U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT12_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13_MASK (0x2000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13_SHIFT (13U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT13_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14_MASK (0x4000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14_SHIFT (14U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT14_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15_MASK (0x8000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15_SHIFT (15U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT15_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16_MASK (0x10000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16_SHIFT (16U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT16_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17_MASK (0x20000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17_SHIFT (17U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT17_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18_MASK (0x40000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18_SHIFT (18U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT18_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19_MASK (0x80000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19_SHIFT (19U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT19_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20_MASK (0x100000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20_SHIFT (20U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT20_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21_MASK (0x200000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21_SHIFT (21U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT21_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22_MASK (0x400000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22_SHIFT (22U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT22_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23_MASK (0x800000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23_SHIFT (23U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT23_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24_MASK (0x1000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24_SHIFT (24U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT24_MASK)

