zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25_MASK (0x2000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25_SHIFT (25U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT25_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26_MASK (0x4000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26_SHIFT (26U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT26_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27_MASK (0x8000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27_SHIFT (27U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT27_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28_MASK (0x10000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28_SHIFT (28U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT28_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29_MASK (0x20000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29_SHIFT (29U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT29_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30_MASK (0x40000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30_SHIFT (30U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT30_MASK)

#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31_MASK (0x80000000U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31_SHIFT (31U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_1_POR_WDOG_STAT31_MASK)
/*! @} */

/*! @name GPR_W1CP_2 - Write 1 to Clear POR 2 */
/*! @{ */

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0_MASK (0x1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0_SHIFT (0U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT0_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1_MASK (0x2U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1_SHIFT (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT1_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2_MASK (0x4U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2_SHIFT (2U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT2_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3_MASK (0x8U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3_SHIFT (3U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT3_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4_MASK (0x10U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4_SHIFT (4U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT4_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5_MASK (0x20U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5_SHIFT (5U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT5_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6_MASK (0x40U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6_SHIFT (6U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT6_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7_MASK (0x80U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7_SHIFT (7U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT7_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8_MASK (0x100U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8_SHIFT (8U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT8_MASK)

#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9_MASK (0x200U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9_SHIFT (9U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9_WIDTH (1U)
#define K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9_SHIFT)) & K566_LPE_GPR0_GPR_W1CP_2_POR_WDOG_STAT9_MASK)

