zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_MASK (0x1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2_MASK (0x2U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2_SHIFT (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_EXIT_PROC2_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0_MASK (0x8U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0_SHIFT (3U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE0_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1_MASK (0x10U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1_SHIFT (4U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE1_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2_MASK (0x20U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2_SHIFT (5U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE2_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3_MASK (0x40U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3_SHIFT (6U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE3_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4_MASK (0x80U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4_SHIFT (7U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE4_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5_MASK (0x100U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5_SHIFT (8U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE5_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6_MASK (0x200U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6_SHIFT (9U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE6_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7_MASK (0x400U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7_SHIFT (10U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_FUNC_RST_ENTRY_PROC_DONE7_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1_MASK (0x800U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1_SHIFT (11U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL1_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2_SHIFT (12U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL2_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3_MASK (0x2000U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3_SHIFT (13U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL3_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4_MASK (0x4000U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4_SHIFT (14U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL4_MASK)

#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5_MASK (0x8000U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5_SHIFT (15U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5_SHIFT)) & K566_LPE_GPR0_GPR_RWD_0_CORE_FCLK_CTRL5_MASK)
/*! @} */

/*! @name GPR_RWD_1 - Read Write DEST 1 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN_MASK (0x1U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN_SHIFT)) & K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_CLK_EN_MASK)

#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL_MASK (0x1FEU)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL_SHIFT (1U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL_WIDTH (8U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL_SHIFT)) & K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_DIV_VAL_MASK)

#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL_MASK (0x7E00U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL_SHIFT (9U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL_WIDTH (6U)
#define K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL_SHIFT)) & K566_LPE_GPR0_GPR_RWD_1_CLKOUT_LPE_MUX_SEL_MASK)
/*! @} */

/*! @name GPR_ROD_0 - Read Only DEST 0 */
/*! @{ */

