zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0_MASK (0x1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0_SHIFT (0U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE0_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1_MASK (0x2U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1_SHIFT (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE1_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2_MASK (0x4U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2_SHIFT (2U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE2_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3_MASK (0x8U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3_SHIFT (3U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE3_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4_MASK (0x10U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4_SHIFT (4U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE4_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5_MASK (0x20U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5_SHIFT (5U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE5_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6_MASK (0x40U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6_SHIFT (6U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE6_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7_MASK (0x80U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7_SHIFT (7U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE7_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8_MASK (0x100U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8_SHIFT (8U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE8_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9_MASK (0x200U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9_SHIFT (9U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE9_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10_MASK (0x400U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10_SHIFT (10U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE10_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11_MASK (0x800U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11_SHIFT (11U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE11_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12_SHIFT (12U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE12_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13_MASK (0x2000U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13_SHIFT (13U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE13_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14_MASK (0x4000U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14_SHIFT (14U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE14_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15_MASK (0x8000U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15_SHIFT (15U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE15_MASK)

#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16_MASK (0x10000U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16_SHIFT (16U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16_SHIFT)) & K566_LPE_GPR0_GPR_ROD_0_CURRENT_INJ_ACTIVE16_MASK)

