zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7_MASK (0x80U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7_SHIFT (7U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE7_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8_MASK (0x100U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8_SHIFT (8U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE8_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9_MASK (0x200U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9_SHIFT (9U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE9_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10_MASK (0x400U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10_SHIFT (10U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE10_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11_MASK (0x800U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11_SHIFT (11U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE11_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12_MASK (0x1000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12_SHIFT (12U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE12_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13_MASK (0x2000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13_SHIFT (13U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE13_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14_MASK (0x4000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14_SHIFT (14U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE14_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15_MASK (0x8000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15_SHIFT (15U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_ACTIVE15_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16_MASK (0x10000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16_SHIFT (16U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE16_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17_MASK (0x20000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17_SHIFT (17U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE17_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18_MASK (0x40000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18_SHIFT (18U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE18_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19_MASK (0x80000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19_SHIFT (19U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE19_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20_MASK (0x100000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20_SHIFT (20U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE20_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21_MASK (0x200000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21_SHIFT (21U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE21_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22_MASK (0x400000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22_SHIFT (22U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE22_MASK)

#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23_MASK (0x800000U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23_SHIFT (23U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23_SHIFT)) & K566_LPE_GPR0_GPR_ROD_1_CURRENT_INJ_COMPLETE23_MASK)

