zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29_MASK (0x20000000U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29_SHIFT (29U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29_SHIFT)) & K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE29_MASK)

#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30_MASK (0x40000000U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30_SHIFT (30U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30_SHIFT)) & K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE30_MASK)

#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31_MASK (0x80000000U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31_SHIFT (31U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31_SHIFT)) & K566_LPE_GPR0_GPR_ROD_2_CURRENT_INJ_COMPLETE31_MASK)
/*! @} */

/*! @name GPR_RWF_0 - Read Write FUNC 0 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY_MASK (0x1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY_SHIFT (0U)
#define K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXT_WAKE_POLARITY_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1_MASK (0x2U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1_SHIFT (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_1_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1_MASK (0x4U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1_SHIFT (2U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_1_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2_MASK (0x8U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2_SHIFT (3U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_OVERRIDE_2_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2_MASK (0x10U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2_SHIFT (4U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_SW_STATE_2_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE_MASK (0x20U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE_SHIFT (5U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE(x)  (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_EXTWAKE_MODE_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL_MASK (0xC0U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL_SHIFT (6U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL_WIDTH (2U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_LPE_LCU_MUX_SEL_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0_MASK (0x300U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0_SHIFT (8U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0_WIDTH (2U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL0_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1_MASK (0x1800U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1_SHIFT (11U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1_WIDTH (2U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL1_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2_MASK (0x6000U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2_SHIFT (13U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2_WIDTH (2U)
#define K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_LPE_LPCMP_MUX_SEL2_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0_MASK    (0x18000U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0_SHIFT   (15U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0_WIDTH   (2U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_MUX_SEL0_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1_MASK    (0x60000U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1_SHIFT   (17U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1_WIDTH   (2U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_MUX_SEL1_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2_MASK    (0x180000U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2_SHIFT   (19U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2_WIDTH   (2U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_MUX_SEL2_MASK)

