zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR0.h
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3_MASK    (0x600000U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3_SHIFT   (21U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3_WIDTH   (2U)
#define K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_MUX_SEL3_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0_MASK (0x800000U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0_SHIFT (23U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL0_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1_MASK (0x1000000U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1_SHIFT (24U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL1_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2_MASK (0x2000000U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2_SHIFT (25U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL2_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3_MASK (0x4000000U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3_SHIFT (26U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL3_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4_MASK (0x8000000U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4_SHIFT (27U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_CORE_CLK_CTRL4_MASK)

#define K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN_MASK (0x10000000U)
#define K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN_SHIFT (28U)
#define K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN_SHIFT)) & K566_LPE_GPR0_GPR_RWF_0_SW_POR_RST_EN_MASK)
/*! @} */

/*! @name GPR_RWF_1 - Read Write FUNC 1 */
/*! @{ */

#define K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH_MASK (0x20000U)
#define K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH_SHIFT (17U)
#define K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH_WIDTH (1U)
#define K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH(x)  (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH_SHIFT)) & K566_LPE_GPR0_GPR_RWF_1_SKIP_FW_AUTH_MASK)

#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0_MASK    (0x40000000U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0_SHIFT   (30U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0_WIDTH   (1U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0_SHIFT)) & K566_LPE_GPR0_GPR_RWF_1_LOCK_EN0_MASK)

#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1_MASK    (0x80000000U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1_SHIFT   (31U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1_WIDTH   (1U)
#define K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1(x)      (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1_SHIFT)) & K566_LPE_GPR0_GPR_RWF_1_LOCK_EN1_MASK)
/*! @} */

/*! @name GPR_ROF_0 - Read Only FUNC 0 */
/*! @{ */

#define K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN_MASK  (0x1U)
#define K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN_SHIFT (0U)
#define K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN_WIDTH (1U)
#define K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN(x)    (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN_SHIFT)) & K566_LPE_GPR0_GPR_ROF_0_POR_WDG_EN_MASK)
/*! @} */

/*! @name GPR_ROF_1 - Read Only FUNC 1 */
/*! @{ */

#define K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST_MASK (0x7FFFFFFU)
#define K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST_SHIFT (0U)
#define K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST_WIDTH (27U)
#define K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST_SHIFT)) & K566_LPE_GPR0_GPR_ROF_1_DEVICE_CONFIG_RESULT_LAST_MASK)
/*! @} */

/*! @name GPR_ROF_2 - Read Only FUNC 2 */
/*! @{ */

#define K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV_MASK (0x7FFFFFFU)
#define K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV_SHIFT (0U)
#define K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV_WIDTH (27U)
#define K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV_SHIFT)) & K566_LPE_GPR0_GPR_ROF_2_DEVICE_CONFIG_RESULT_PREV_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group K566_LPE_GPR0_Register_Masks */

/*!
 * @}
 */ /* end of group K566_LPE_GPR0_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_K566_LPE_GPR0_H_) */
